app/views/moods/index.html.erb

SELECT "moods".* FROM "moods"
---

	<% Mood.all.each do |mood| %>