app/views/songs/_form.html.erb


<% ims = IntensitiesMoodsSong.where(song: @song.id) %>
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]
SELECT "intensities_moods_songs".* FROM "intensities_moods_songs" WHERE "intensities_moods_songs"."song_id" = 27

<%= f.label :mood %>
<% Mood.all.each do |mood| %>
---
SELECT "moods".* FROM "moods"

<%= f.label :intensity %>
<% Intensity.all.each do |intensity| %>
  <%= label_tag "intensity_id_#{intensity.id}".to_sym, intensity.name %>
  <%= radio_button_tag :intensity_id, intensity.id, checked = (ims.count > 0 && ims[0].intensity_id == intensity.id) %>
---
SELECT "intensities".* FROM "intensities"
SELECT COUNT(*) FROM "intensities"