app/views/songs/index.html.erb

SELECT "songs".* FROM "songs"
---

	<% Song.all.each do |song| %>

SELECT "intensities_moods_songs".* FROM "intensities_moods_songs" WHERE "intensities_moods_songs"."song_id" = 3
---

		<% ims = IntensitiesMoodsSong.where(song: song.id) %>

SELECT  "moods".* FROM "moods" WHERE "moods"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "intensities".* FROM "intensities" WHERE "intensities"."id" = ? LIMIT 1  [["id", 1]]
---

		   <td><%= Mood.find(ims[0].mood_id).name + extra_char %></td>
		   <td><%= Intensity.find(ims[0].intensity_id).name + extra_char %></td>