app/views/songs/show.html.erb

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT "intensities_moods_songs".* FROM "intensities_moods_songs" WHERE "intensities_moods_songs"."song_id" = 15
---

<% ims = IntensitiesMoodsSong.where(song: @song.id) %>

SELECT  "moods".* FROM "moods" WHERE "moods"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "intensities".* FROM "intensities" WHERE "intensities"."id" = ? LIMIT 1  [["id", 1]]
---
<% ims.each do |obj| %>
  <p><%= Mood.find(obj.mood).name %></p>
  <p><%= Intensity.find(obj.intensity). name %></p>