app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)

    respond_to do |format|
      if @song.save
---
INSERT INTO "songs" ("name", "artist", "audio_url", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test Song the First"], ["artist", ""], ["audio_url", ""], ["image_url", ""], ["created_at", "2015-06-04 19:03:51.875822"], ["updated_at", "2015-06-04 19:03:51.875822"]]

  def update
    respond_to do |format|
      if @song.update(song_params)
---
UPDATE "songs" SET "name" = ?, "copyright" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["name", "We sold this song"], ["copyright", "Licensed"], ["updated_at", "2015-06-11 20:07:31.063235"], ["id", 27]]